{
    "2.0.0": [ "Dawnbreak",
        "-Complete from scratch rewrite, now using using nextcord wrapper and cogs/modules."
    ],
    "2.1.0": [ "Previews",
        "-Added; admin: Auditlog triggers for own pruge command, and blacklist add/remove.",
        "-Added; bot: Added config option for ready message.",
        "-Added; general: Basic convert slash command.",
        "-Added; TpF: Mod Preview embed. Monitors the #mod-release channel.",
        "-Changed: auditlog: if auditlog trigger is passed but no audit channel, defaults to personal server.",
        "-Fixed; auditlog: Fixed userKicked to not check author name to guild name. (Why it was doing that ???)"
    ],
    "2.1.1": [ "Previews",
        "-Fixed; NIX: Aussie and Kiwi roles buttons. Config file variable typo."
    ],
    "2.1.2": [ "Previews",
        "-Changed; general: ping command no longer requires api, anything will trigger it."
    ],
    "2.2.0": [ "Updates",
        "-Added: Bot is now started via a script which does various checks and grabs the latest bot version from Github, runs bot in new folder. If bot exits, script will restart it. Tigger script included for auditing purpose, it resides in parent folder of bot.",
        "-Added; bot: Commands to update config.json or restart the bot. OwnerOnly",
        "-Added; bot: Memory command to see currently used RAM usuage of process and system. Also hostname. OwnerOnly.",
        "-Added; fileUtil: parentDir function to get the parent folder of fileUtil. This is assuming the parent is script root.",
        "-Added; fileUtil: readJSON function will now cache all read files. Optional 'cache' arg if not desired",
        "-Added; fileUtil: configUpdate function takes json file and merges it into existing config.json file.",
        "-Added; general: Slash version of member count and ping commands",
        "-Added; general: Profile slash command. Works with mentions and IDs",
        "-Added; general: Command to get the changelog. Arg to either list versions or get specific, default to latest.",
        "-Added; genUtil: New utility file to house small functions useful across modules.",
        "-Added; genUtil: getCol function. arg = name of colour in config.json. Returns the a from_rgb colour object",
        "-Added; modding: New utility file to house modding related functions.",
        "-Added; nix: modPreview now avaliable for the Linux server",
        "-Added; ssctime: Timestamp command to either get (current, next, remind) timestamps or set them.",
        "-Added; views: Roles can now be only add or remove.",
        "-Added; views: Verified role for TpF server.",
        "-Changed; Configuration: Config is now from a JSON file. Almost all calls to config were changed.",
        "-Changed; auditlog: Message Deleted embed with remove all '`' with nothing.",
        "-Removed; bot: Net checking and other ingretity checks now don't by external script.",
        "-Changed: bot, fileUtil: Now OS independent.",
        "-Changed; bot: Config file existence check is now a list and will exit if file isn't found.",
        "-Changed; fileUtil: readJSON and writeJSON now require list containing the folders from root to desired file. Empty for root.",
        "-Changed; genUtilp: Blacklist check is now actally called by both regular commands and slash commands. Also it was rewritten.",
        "-Changed; general: Convert slash command now has descriptions.",
        "-Changed; general: Fact embed now sets the url as source if avaliable.",
        "-Changed; modding: modPreview now accepts an imgage attachment, it will override any url from mod source.",
        "-Changed; tpf: modPreview now in util.modding.",
        "-Changed; tpfssc: data.json merged into new config.json. Functions changed appropriately",
        "-Changed; views: Now only one clicky function.",
        "-Fixed; auditlog: checkKickBan will now grab the last 3 entries and will now consider entries up to 15 seconds old instead of just 5.",
        "-Fixed; auditlog: checkKickBan no longer checks banned username against guild name. (Why it was doing that ???)"
    ],
    "2.2.1":[ "Updates",
        "-Changed: Blacklist checks on all commands, including admin.",
        "-Changed; bot: Version for ready message now pulled from changelog.json, then config is updated.",
        "-Changed; tpfssc: timestamp and timestampset functions are now in tpfssc cog.",
        "-Fixed; auditlog: Message content properly wrapped in backticks",
        "-Fixed; Configuration: Is actually read when need instead of only when the file is loaded. *facepalm*",
        "-Fixed; general: changelog commmand will now split changelog entry if too long. Here I was think the limit was 4000",
        "-Fixed; tpfssc: Reminder task checks remindSent instead of isPrize."
    ]
}