{
	"2.0.0": [ "Dawnbreak::20220310",
		"-Complete from scratch rewrite, now using using nextcord wrapper and cogs/modules."
	],
	"2.0.1": [ "Dawnbreak::20220316",
		"-Fixed; auditlog: kick log entry not tiggering."
	],
	"2.1.0": [ "Previews::20220324",
		"-Added; admin: Auditlog triggers for own pruge command, and blacklist add/remove.",
		"-Added; bot: Added config option for ready message.",
		"-Added; general: Basic convert slash command.",
		"-Added; TpF: Mod Preview embed. Monitors the #mod-release channel.",
		"-Changed: auditlog: if auditlog trigger is passed but no audit channel, defaults to personal server.",
		"-Fixed; auditlog: Fixed userKicked to not check author name to guild name. (Why it was doing that ???)"
	],
	"2.1.1": [ "Previews::20220329",
		"-Fixed; NIX: Aussie and Kiwi roles buttons. Config file variable typo."
	],
	"2.1.2": [ "Previews::20220331",
		"-Changed; general: ping command no longer requires api, anything will trigger it."
	],
	"2.2.0": [ "Updates::20220423",
		"-Added: Bot is now started via a script which does various checks and grabs the latest bot version from Github, runs bot in new folder.\nIf bot exits, script will restart it. Tigger script included for auditing purpose, it resides in parent folder of bot.",
		"-Added; bot: Commands to update config.json or restart the bot. OwnerOnly",
		"-Added; bot: Memory command to see currently used RAM usuage of process and system. Also hostname. OwnerOnly.",
		"-Added; fileUtil: parentDir function to get the parent folder of fileUtil. This is assuming the parent is script root.",
		"-Added; fileUtil: readJSON function will now cache all read files. Optional 'cache' arg if not desired",
		"-Added; fileUtil: configUpdate function takes json file and merges it into existing config.json file.",
		"-Added; general: Slash version of member count and ping commands",
		"-Added; general: Profile slash command. Works with mentions and IDs",
		"-Added; general: Command to get the changelog. Arg to either list versions or get specific, default to latest.",
		"-Added; genUtil: New utility file to house small functions useful across modules.",
		"-Added; genUtil: getCol function. arg = name of colour in config.json. Returns the a from_rgb colour object",
		"-Added; modding: New utility file to house modding related functions.",
		"-Added; nix: modPreview now avaliable for the Linux server",
		"-Added; ssctime: Timestamp command to either get (current, next, remind) timestamps or set them.",
		"-Added; views: Roles can now be only add or remove.",
		"-Added; views: Verified role for TpF server.",
		"-Changed; Configuration: Config is now from a JSON file. Almost all calls to config were changed.",
		"-Changed; auditlog: Message Deleted embed with remove all '`' with nothing.",
		"-Changed; fileUtil: Now OS independent. Moving forward I'm going to try and support both Linux and Windows but since I primarily use Linux, that is my main concern.",
		"-Changed; bot: Config file existence check is now a list and will exit if file isn't found.",
		"-Changed; fileUtil: readJSON and writeJSON now require list containing the folders from root to desired file. Empty for root.",
		"-Changed; genUtil: Blacklist check is now actally called by both regular commands and slash commands. Also it was rewritten.",
		"-Changed; general: Convert slash command now has descriptions.",
		"-Changed; general: Fact embed now sets the url as source if avaliable.",
		"-Changed; modding: modPreview now accepts an imgage attachment, it will override any url from mod source.",
		"-Changed; tpf: modPreview now in util.modding.",
		"-Changed; tpfssc: data.json merged into new config.json. Functions changed appropriately",
		"-Changed; views: Now only one clicky function.",
		"-Removed; bot: Net checking and other integrity checks now don't by external script.",
		"-Fixed; auditlog: checkKickBan will now grab the last 3 entries and will now consider entries up to 15 seconds old instead of just 5.",
		"-Fixed; auditlog: checkKickBan no longer checks banned username against guild name. (Why it was doing that ???)"
	],
	"2.2.1":[ "Updates::20220424",
		"-Changed: Blacklist checks on all commands, including admin.",
		"-Changed; bot: Version for ready message now pulled from changelog.json, then config is updated.",
		"-Changed; tpfssc: timestamp and timestampset functions are now in tpfssc cog.",
		"-Fixed; auditlog: Message content properly wrapped in backticks",
		"-Fixed; Configuration: Is actually read when need instead of only when the file is loaded. *facepalm*",
		"-Fixed; general: changelog commmand will now split changelog entry if too long. Here I was think the limit was 4000",
		"-Fixed; tpfssc: Reminder task checks remindSent instead of isPrize."
	],
	"2.2.2":[ "Updates::20220425",
		"-Fixed: All blacklist checks are now awaited.",
		"-Fixed; tpfssc: comp command timestamp set changed to reflect previous changes."
	],
	"2.3.0":[ "Competition::20220612",
		"-Added; admin: Slash version of purge command.",
		"-Added; apiUtil: Can now get Google Sheets",
		"-Changed: Logging is now multihead to file and console with different formats",
		"-Changed: Logs are now in own folder.",
		"-Changed; admin: Purge slash command now enforces limit.",
		"-Changed; bot: New version number from changelog is no longer dependant on if the ReadyMessage is true.\nAlso it's only written if it's different.",
		"-Changed; bot: Version is now in the user activity.",
		"-Changed; bot: Nextcord version in ready message.",
		"-Changed; general: Changelog now includes date update was released.",
		"-Changed; general: Convert redone. Now using choices and feedbacks when error.",
		"-Changed; tpfssc: themeVote command redone as slash command. Can also update local theme list from Google Sheet [not by default - SSCManager Only].\nAlso custom themes and vote for text, so can be used to vote on other things.",
		"-Changed; tpfssc: comp command redone as slash command. Now can post the full banner images to either tpf or other games ss chans.",
		"-Changed; tpfssc: remindTask uses new alertType instead of either here or everyone based on isPrize.",
		"-Changed; tpfssc: on_message can ignore users with winner/runnerup roles.",
		"-Changed; tpfssc: delete command redone as slash command.",
		"-Removed; tpfssc: No longer check for themes.txt",
		"-Fixed; general: Emoji command redone. for loops for the win.",
		"-Fixed; tpfssc: themeVote command won't pick current theme"
	],
	"2.3.1":[ "Competition::20220613",
		"-Added; admin: Super simply command to add/replace a file with uploaded one."
	],
	"2.4.0":[ "Toggles::20220629",
		"-Added: generalEvent cog to house events like on_message or on_member_update that aren't server specific.\nAll items from tpf, nix, and vk have been moved and combined.",
		"-Added: suggestions cog to house things related to suggestions for the bot, game, etc.\nFor now they're DMed to owner (APasz).",
		"-Added; config: Global and server specific toggles most for events in generalEvent.\nOn load or invoked via new updateEventList command or toggleEvent slash command, these settings are written to file, so it can be cache separately. #3", 
		"-Added; generalEvent: On_raw_member_remove just in case a member isn't in the interal cache for some reason. Checks if regular one has been called.",
		"-Added; modding: Mod releases in other servers can now be posted to the global server as well.",
		"-Changed: Now using black formatting.",
		"-Changed; cogs: auditlog renamed to auditLog and auditlog class renamed to auditLogger, gamehelp renamed to gameHelp, tpfssc renamed to ssc",
		"-Removed: tpf, nix, and vk cogs.",
		"-Fixed; bot: On ready now writes the new version to config instead of the old. I have no idea why or how this changed.",
		"-Fixed; modding: modRelease splits message content at spaces rather than newlines so multiple mods links can be on the same line now."
	],
	"2.5.0":[ "Configuration::20220708",
		"-Added; admin: Configuration slash command that allows server admins to change existing value in config.json. #6",
		"-Added; botManage: New cog to house commands and whatnot for managing the bot, wow. Currently only the extension commands are here.",
		"-Changed; admin: toggleEvent command moved to generalEvent cog.",
		"-Changed; auditLog: type keys are now more human readable. eg MessageDelete instead of M_D.",
		"-Changed; config: Guilds are now separated by their ID rather than friendly name. Many changes were required across the codebase.\nTook the oppotunity to clean up some config related stuff.",
		"-Changed; config: Practically all items moved into dataclasses.\nMany changes were required across the codebase but type-hinting and autocomplete are nice.",
		"-Changed; generalEvent: toggleEvent is now restricted to the current guild.\nAnd better shows the current state, O = True X = False",
		"-Changed; modding: Upgraded to a cog.",
		"-Fixed; generalEvent: Can now be reloaded. #15",
		"-Fixed; generalEvent: toggleEvent command autocomplete now works better."
	],
	"2.5.1": ["Configuration::20220708",
		"-Fixed; generalEvent|modding: Not passing self to modRelease and modPreview, also incorect use of self in modding.",
		"-Fixed; ssc: Reminder task given an int instead of a channel object."
	],
	"2.5.2": ["Configuration::20220708",
		"-Fixed; admin: roleButton command checks guilds config name with str instead of int.",
		"-Fixed; views: hasRole function updated to use correct keyword argument."
	],
	"2.5.3": ["Configuration::20220720",
		"-Added; config: Notfiy channel to admin channels section.\nAlso a MISC section that currently only holds the time in hours a account is considered recently created.",
		"-Added; generalEvent, auditLog: When a user joins with a recently created account, an embed message is sent to the Notify channel.",
		"-Fixed; auditLog: Errors in userRemove and checkKickBan that blocked auditlog entries being sent when member leaves.",
		"-Fixed; bot: Global ReadyMessage setting is respected. Also won't block the restart stuff. #17",
		"-Fixed; generalEvent: Events error when there is no guild id.",
		"-Fixed; generalEvent: on_member_remove actually logs user id.",
		"-Fixed; modding: #16 Replace instances of newline with space first."
	],
	"2.6.0": ["Backend::20220911",
        "New name, Katoku. A Japanese word meaning heir or successor, cause who knows what the future holds. New PFP. And now hosted on a paid OVH server in Sydney, Australia.",
        "-Added: strings.json file to house translations. A few things use it.\nAs time goes on things will be moved over. Currently only contains 'en'. Also no command yet to edit or add.",
        "-Added; botManage: New hidden owner only command to dump the JSON cache (-c), or (also either update (-u)) all of the config classes in config (-d). ",
        "-Added; config: The bot version and additional info is now stored in its own special class in config.",
        "-Added; config: A couple checks for values in config.json. More checks will likely be added over time.\nFunctions that don't already have safeguards, will get them over time.",
        "-Added; generalEvent: Event configuration is now stored in it's own class in config.",
        "-Added; general: Slash command to submit a random fact. Invokes a modal.",
        "-Added; general: Info slash command to fetch various bits of infomation about eiter the bot and host system or the current guild.\nIs also able to trigger the profile command.",
        "-Added; ssc: 4th preset reason (too many submissions) to delete command.",
        "-Changed: Some slash commands are now global.",
        "-Changed; admin|general: react command moved from general to admin",
        "-Changed; bot: Rotating logs. New log every monday. Also slightly different format.",
        "-Changed; config: Many config related things have been moved to config, almost all are singleton classes.",
        "-Changed; dependency: Requirements now have a specified version. Version bumps will now be included in changelog.",
        "-Changed; dependency: Nextcord 2.0.0 -> ~2.2.0",
        "-Changed; general: Conversion command now sends a regular text response instead of embed.",
        "-Changed; general: randomFacts.txt is now facts.json which contains more info.\nfact commands|def redone to accomdate. index (int) and metadata (bool) args can be passed to commands. If the index doesn't not exist, a random index is chosen.",
        "-Changed; general: Ping command now supports multiple tests (up to 5 as to not hit any rate-limit).\nThe function is now consolidated and resides in genUtil as it's now also used by the info command.",
        "-Changed; views: Verified button now also removes the unverified role",
        "-Changed|Removed; botTrigger: Completely rewritten and now in it's own repository. https://github.com/APasz/triggerScript",
		"-Fixed; general: Convert command now has UK and US varients of imperial units. Also checks are consistent.",
		"-Fixed; generalEvent: modPreview now actually gets the global nmp channel. #22",
        "-Fixed; ssc: The themevote command now defers the interaction response if the update option is True.",
        "-Cleanup: Removing unused code and imports, adding docstrings, better more consistent logging, general organisation, and so many try excepts I now have a keybind for them."
	],
    "2.6.1": ["Backend::20220912",
        "-Fixed; generalEvent: configuration command actually updates the config class.",
        "-Fixed; ssc: Not recognising any messages in ssc channel."
    ]
}
